ymaps.ready(init);
var myMap,
    myPlacemark,
    myUnis = [
        { short_name: "БГТУ, №1", full_name: "Брянский государственный технический университет, учебный корпус №1", coordinates: [53.30506107113834, 34.3051245] },
        { short_name: "БГТУ, №2", full_name: "Брянский государственный технический университет, учебный корпус №2", coordinates: [53.30442607113672, 34.30389399999998] },
        { short_name: "БГТУ, №3", full_name: "Брянский государственный технический университет, учебный корпус №3", coordinates: [53.3052650711389,34.30680449999995] },
        { short_name: "БГТУ, №4", full_name: "Брянский государственный технический университет, учебный корпус №4", coordinates: [53.303231071133645, 34.30540299999989] },
        { short_name: "БГАУ", full_name: "Брянский государственный аграрный университет", coordinates: [53.15597157124663, 34.120358999999986] },
        { short_name: "БГИТУ", full_name: "Брянский государственный инженерно-технологический университет", coordinates: [53.24918157119723, 34.342252]},
        { short_name: "БГУ им. Петровского", full_name: "Брянский государственный университет имени академика И. Г. Петровского", coordinates: [53.27228907116983, 34.35254649999995] },
        { short_name: "БИУБ", full_name: "Брянский институт управления и бизнеса", coordinates: [53.24842757119526, 34.32833700000002]},
        { short_name: "филиал МЭСИ", full_name: "Брянский колледж экономики, статистики и информатики - филиал Московского государственного университета экономики, статистики и информатики", coordinates: [53.229085571203356, 34.33196650000001] },
        { short_name: "филиал МИГУП", full_name: "Брянский филиал Московского института государственного управления и права", coordinates: [53.271519071167845, 34.34456949999989] },
        { short_name: "филиал МСИ", full_name: "Брянский филиал Международного славянского института имени Г. Р. Державина", coordinates: [53.233500071185766, 34.32503149999999] },
        { short_name: "филиал МАБиУ", full_name: "Брянский филиал Международной академии бизнеса и управления", coordinates: [53.26125457117042, 34.32917249999995] },
        { short_name: "филиал ИМИТ", full_name: "Брянский филиал Московского государственного университета путей сообщения", coordinates: [53.203888071225315, 34.415824] },
        { short_name: "филиал МИРТШБ", full_name: "Брянский филиал Московского института рекламы, туризма, шоу-бизнеса", coordinates: [53.21020357121263, 34.44644750000003]},
        { short_name: "филиал МосУ МВД России", full_name: "Брянский филиал Московского университета Министерства внутренних дел Российской Федерации имени В.Я. Кикотя", coordinates: [53.252974571206956, 34.35322049999998] },
        { short_name: "филиал НГУ им. Лесгафта", full_name: "Брянский филиал Национального государственного университета физической культуры, спорта и здоровья имени П.Ф. Лесгафта, Санкт-Петербург", coordinates: [53.266392571183594, 34.36303899999998] },
        { short_name: "филиал РГТЭУ", full_name: "Брянский филиал Российского государственного торгово-экономического университета", coordinates: [53.27050207116525, 34.35451399999996] },
        { short_name: "филиал РУК", full_name: "Брянский филиал Российского университета кооперации", coordinates: [53.243491571182545, 34.367440499999994] },
        { short_name: "филиал РАНХиГС", full_name: "Брянский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации", coordinates: [53.243367571182226, 34.36965949999999] },
        { short_name: "филиал СГА", full_name: "Брянский филиал Современной гуманитарной академии", coordinates: [53.25261907117711, 34.34767749999989] },
        { short_name: "филиал РФЭИ", full_name: "Брянское агентство Регионального финансово-экономического института", coordinates: [53.24099657117614,34.32892999999999] },
        { short_name: "филиал ВЗФЭИ", full_name: "Филиал Всероссийского заочного финансово-экономического института в г. Брянске", coordinates: [53.264760571179394,34.359553499999954] },
        { short_name: "филиал МНЮИ", full_name: "Филиал Московского нового юридического института в г. Брянске", coordinates: [53.31394357113219,34.31767399999997] },
        { short_name: "филиал МПГУ", full_name: "Филиал Московского педагогического государственного университета в городе Брянске", coordinates: [53.24205257117887,34.37379199999995] },
        { short_name: "филиал МПСУ", full_name: "Филиал Московского психолого-социального института в г. Брянске", coordinates: [53.26690957118495,34.35702049999996] },
        { short_name: "филиал РГСУ", full_name: "Филиал Российского государственного социального университета в г. Брянске", coordinates: [53.211018571214744,34.41166449999992] },
    ],
    uniNumber = 26;

function init(){
    myMap = new ymaps.Map("map", {
        center: [53.24, 34.36],
        zoom: 12
    });

    for (i = 0; i < uniNumber; i++)
    {
        myPlacemark = new ymaps.Placemark(myUnis[i].coordinates, {
            hintContent: myUnis[i].short_name,
            balloonContent: myUnis[i].full_name
        }, {
            iconLayout: 'default#image',
            iconImageHref: 'assets/img/university-clipart-mu4.gif'
        });

        myMap.geoObjects.add(myPlacemark);
    }
}